Tekla Open API Reference for Tekla Structures 2025
Distance.ToString Method (IFormatProvider)
 Creates a string representation of the distance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToString(
	IFormatProvider formatProvider
)
Public Function ToString (
	formatProvider As IFormatProvider
) As String
Parameters
formatProvider
Type: System.IFormatProvider
The number format provider.
Return Value
Type: String
The string representation of the distance.
Examples
 This example shows how to specify a format provider when converting a Distance instance to a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           // Tekla Structures uses dot as the decimal separator in all locales.
           string formattedString = distance.ToString(CultureInfo.InvariantCulture);
       }
}
See Also
Reference
Distance Structure
ToString Overload
Tekla.Structures.Datatype Namespace